bouffalolab/bl_iot_sdk/customer_app/bl602_huawei_cloud/bl602_demo_wifi/main.c
/*
 * Copyright (c) 2020 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <FreeRTOS.h>
#include <task.h>
#include <timers.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include <vfs.h>
#include <aos/kernel.h>
#include <aos/yloop.h>
#include <event_device.h>
#include <cli.h>

#include <lwip/tcpip.h>
#include <lwip/sockets.h>
#include <lwip/netdb.h>
#include <lwip/tcp.h>
#include <lwip/err.h>
#include <http_client.h>
#include <netutils/netutils.h>

#include <bl602_glb.h>
#include <bl602_hbn.h>

#include <bl_uart.h>
#include <bl_chip.h>
#include <bl_wifi.h>
#include <hal_wifi.h>
#include <bl_sec.h>
#include <bl_cks.h>
#include <bl_irq.h>
#include <bl_dma.h>
#include <bl_timer.h>
#include <bl_gpio_cli.h>
#include <bl_wdt_cli.h>
#include <hal_uart.h>
#include <hal_sys.h>
#include <hal_gpio.h>
#include <hal_boot2.h>
#include <hal_board.h>
#include <looprt.h>
#include <loopset.h>
#include <sntp.h>
#include <bl_sys_time.h>
#include <bl_sys_ota.h>
#include <bl_romfs.h>
#include <fdt.h>

#include <easyflash.h>
#include <bl60x_fw_api.h>
#include <wifi_mgmr_ext.h>
#include <utils_log.h>
#include <libfdt.h>
#include <blog.h>

#include <looprt.h>
#include <loopset.h>
#include <loopset_i2c.h>
#include <hal_i2c.h>
#include <bl_i2c.h>
#include <semphr.h>
#include <hal_hwtimer.h>

#ifdef CONFIG_HWCLOUD_IOT_LINK
#include <example_hwcloud_iot_link.h> 
#endif

#define mainHELLO_TASK_PRIORITY     ( 20 )
#define UART_ID_2 (2)
#define WIFI_AP_PSM_INFO_SSID           "conf_ap_ssid"
#define WIFI_AP_PSM_INFO_PASSWORD       "conf_ap_psk"
#define WIFI_AP_PSM_INFO_PMK            "conf_ap_pmk"
#define WIFI_AP_PSM_INFO_BSSID          "conf_ap_bssid"
#define WIFI_AP_PSM_INFO_CHANNEL        "conf_ap_channel"
#define WIFI_AP_PSM_INFO_IP             "conf_ap_ip"
#define WIFI_AP_PSM_INFO_MASK           "conf_ap_mask"
#define WIFI_AP_PSM_INFO_GW             "conf_ap_gw"
#define WIFI_AP_PSM_INFO_DNS1           "conf_ap_dns1"
#define WIFI_AP_PSM_INFO_DNS2           "conf_ap_dns2"
#define WIFI_AP_PSM_INFO_IP_LEASE_TIME  "conf_ap_ip_lease_time"
#define WIFI_AP_PSM_INFO_GW_MAC         "conf_ap_gw_mac"
#define CLI_CMD_AUTOSTART1              "cmd_auto1"
#define CLI_CMD_AUTOSTART2              "cmd_auto2"

extern void ble_stack_start(void);
/* TODO: const */
volatile uint32_t uxTopUsedPriority __attribute__((used)) =  configMAX_PRIORITIES - 1;
static uint32_t time_main;

static wifi_conf_t conf =
{
    .country_code = "CN",
};
extern uint8_t _heap_start;
extern uint8_t _heap_size; // @suppress("Type cannot be resolved")
extern uint8_t _heap_wifi_start;
extern uint8_t _heap_wifi_size; // @suppress("Type cannot be resolved")
static HeapRegion_t xHeapRegions[] =
{
        { &_heap_start,  (unsigned int) &_heap_size}, //set on runtime
        { &_heap_wifi_start, (unsigned int) &_heap_wifi_size },
        { NULL, 0 }, /* Terminates the array. */
        { NULL, 0 } /* Terminates the array. */
};
static wifi_interface_t wifi_interface;

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName )
{
    puts("Stack Overflow checked\r\n");
    printf("Task Name %s\r\n", pcTaskName);
    while (1) {
        /*empty here*/
    }
}

void vApplicationMallocFailedHook(void)
{
    printf("Memory Allocate Failed. Current left size is %d bytes\r\n",
        xPortGetFreeHeapSize()
    );
    while (1) {
        /*empty here*/
    }
}

void vApplicationIdleHook(void)
{
#if 0
    __asm volatile(
            "   wfi     "
    );
    /*empty*/
#else
    (void)uxTopUsedPriority;
#endif
}
extern int hw_sensoremperature;
extern int hw_sensorhumidity;
static hw_timer_t *sensor_timer = NULL; 
int GXHT3X_test(void)
{

    i2c_msg_t init_msg[2];
    uint8_t   init_buf[2];
    uint8_t   sensor_buf[6];
    
    uint16_t tem;
    uint16_t hum;

    memset(sensor_buf, 0, 6);
    init_buf[0]=0x2C;
    init_buf[1]=0x10;

 
    init_msg[0].addr = 0x45;
    init_msg[0].subflag = 0;
    init_msg[0].subaddr = 0;
    init_msg[0].buf = init_buf;
    init_msg[0].direct = I2C_M_WRITE;
    init_msg[0].block = I2C_M_NO_BLOCK;
    init_msg[0].len = 2;
    init_msg[0].idex = 0;
    init_msg[0].sublen = 0;
    init_msg[0].i2cx = 0;
    i2c_transfer_msgs_block(init_msg, 1, 0);

    vTaskDelay(500);
    
    init_msg[0].addr = 0x45;
    init_msg[0].subflag = 0;
    init_msg[0].subaddr = 0;
    init_msg[0].buf = sensor_buf;
    init_msg[0].direct = I2C_M_READ;
    init_msg[0].block = I2C_M_NO_BLOCK;
    init_msg[0].len = 6;
    init_msg[0].idex = 0;
    init_msg[0].sublen = 0;
    init_msg[0].i2cx = 0;
    i2c_transfer_msgs_block(init_msg, 1, 0);

    tem = ((sensor_buf[0]<<8) | sensor_buf[1]);//温度拼接
	hum = ((sensor_buf[3]<<8) | sensor_buf[4]);//湿度拼接
    
    printf("recv data = %x ,%x %x ,%x\n",sensor_buf[0],sensor_buf[1],sensor_buf[3],sensor_buf[4]);
    hw_sensoremperature= (((175.0*(float)tem)/65535.0)-45.0) ;// T = -45 + 175 * tem / (2^16-1)
	hw_sensorhumidity= ((100.0*(float)hum)/65535.0);// RH = hum*100 / (2^16-1)

    
    if((hw_sensoremperature>=-20)&&(hw_sensoremperature<=125)&&(hw_sensorhumidity>=0)&&(hw_sensorhumidity<=100))//过滤错误数据
	{
        printf("sensor data ok\n");
	
        printf("Temperature:%d*C Humidity%d %% \n",hw_sensoremperature,hw_sensorhumidity);
        return 0;
	
	}else{

