bouffalolab/bl_iot_sdk/customer_app/bl602_huawei_cloud/bl602_demo_wifi/main.c
    return 0;
}

static void __opt_feature_init(void)
{
#ifdef CONF_USER_ENABLE_VFS_ROMFS
    romfs_register();
#endif
}
static void event_cb_i2c_event(input_event_t *event, void *private_data)
{
    switch (event->code) {
        case CODE_I2C_END:
        {
             printf("TRANS FINISH %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_I2C_ARB:
        {
             printf("TRANS ERROR ARB %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_I2C_NAK:
        {
            printf("TRANS ERROR NAK %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_I2C_FER:
        {
            printf("TRANS ERROR FER %lld\r\n", aos_now_ms());
        }
        break;
        default:
        {
             printf("[I2C] [EVT] Unknown code %u, %lld\r\n", event->code, aos_now_ms());
            
        }
    }
}
extern char CN_EP_DEVICEID[128];
extern char CN_EP_PASSWD[32];
extern char HWCLOUD_SSID[33];
extern char HWCLOUD_PWD[32];
static int fdt_huawei_module_init(const void *fdt, int huawei_offset)
{
	const uint32_t *result = NULL;
	int lentmp = 0;
	
	result = fdt_getprop(fdt, huawei_offset, "ssid", &lentmp);
    if (result!=NULL) {
        printf("get ssid value = %s,%d\r\n", result,lentmp);
        memset(HWCLOUD_SSID,0,sizeof(HWCLOUD_SSID)); 
        memcpy(HWCLOUD_SSID,result,lentmp);
    }
	else 
    {
		printf("get ssid value fail\r\n");
        return 1;
	}
    result = NULL;
    result = fdt_getprop(fdt, huawei_offset, "psk", &lentmp);
    if (result!=NULL) {
        printf("get ssid psk = %s,%d\r\n", result,lentmp); 
        memset(HWCLOUD_PWD,0,sizeof(HWCLOUD_PWD)); 
        memcpy(HWCLOUD_PWD,result,lentmp);
    }
	else 
    {
		printf("get ssid psk fail\r\n");
         return 1;
	}
    result = NULL;
    result = fdt_getprop(fdt, huawei_offset, "devid", &lentmp);
    if (result!=NULL) {
        printf("get ssid devid = %s,%d\r\n", result,lentmp); 
        memset(CN_EP_DEVICEID,0,sizeof(CN_EP_DEVICEID)); 
        memcpy(CN_EP_DEVICEID,result,lentmp);
    }
	else 
    {
		printf("get ssid devid fail\r\n");
         return 1;
	}
    result = NULL;
    result = fdt_getprop(fdt, huawei_offset, "devpsw", &lentmp);
    if (result!=NULL) {
        printf("get ssid devpsw = %s,%d\r\n", result,lentmp); 
        memset(CN_EP_PASSWD,0,sizeof(CN_EP_PASSWD)); 
        memcpy(CN_EP_PASSWD,result,lentmp);
    }
	else 
    {
		printf("get ssid devpsw fail\r\n");
         return 1;
	}
    return 0;
}

static void get_huawei_para(uint32_t fdt, uint32_t dtb_offset)
{
	if(0==fdt_huawei_module_init((const void *)fdt, (int)dtb_offset)){

    #ifdef CONFIG_HWCLOUD_IOT_LINK
    example_hwcloud_iot_link(); 
    #endif
    }
}
static void i2c_init_form_dts(uint32_t fdt, uint32_t dtb_offset)
{
   if( 0== hal_i2c_gpio_form_dts((const void *)fdt, (int)dtb_offset)){

       printf("hal_i2c_gpio_form_dts ok\r\n");
       hal_i2c_init(0, 500);
   }
}
static void start_huawei_cloud(void)
{
   uint32_t fdt = 0, offset = 0;
   if (0 == get_dts_addr("huawei", &fdt, &offset)) {
        get_huawei_para(fdt, offset);
    }

}

static void aos_loop_proc(void *pvParameters)
{
    int fd_console;
    uint32_t fdt = 0, offset = 0;
    static StackType_t proc_stack_looprt[512];
    static StaticTask_t proc_task_looprt;

    /*Init bloop stuff*/
    looprt_start(proc_stack_looprt, 512, &proc_task_looprt);
    loopset_led_hook_on_looprt();
    loopset_i2c_hook_on_looprt();
    easyflash_init();
    vfs_init();
    vfs_device_init();

    /* uart */
#if 1
    if (0 == get_dts_addr("uart", &fdt, &offset)) {
        vfs_uart_init(fdt, offset);
    }
#else
    vfs_uart_init_simple_mode(0, 7, 16, 2 * 1000 * 1000, "/dev/ttyS0");
#endif
    if (0 == get_dts_addr("gpio", &fdt, &offset)) {
        hal_gpio_init_from_dts(fdt, offset);
    }
    if (0 == get_dts_addr("i2c", &fdt, &offset)) {
        i2c_init_form_dts(fdt, offset);
    }
   

    __opt_feature_init();
    aos_loop_init();

    fd_console = aos_open("/dev/ttyS0", 0);
    if (fd_console >= 0) {
        printf("Init CLI with event Driven\r\n");
        aos_cli_init(0);
        aos_poll_read_fd(fd_console, aos_cli_event_cb_read_get(), (void*)0x12345678);
        _cli_init();
    }

    aos_register_event_filter(EV_WIFI, event_cb_wifi_event, NULL);
    cmd_stack_wifi(NULL, 0, 0, NULL);
    aos_register_event_filter(EV_I2C, event_cb_i2c_event, NULL);
    aos_loop_run();

    puts("------------------------------------------\r\n");
    puts("+++++++++Critical Exit From Loop++++++++++\r\n");
    puts("******************************************\r\n");
    vTaskDelete(NULL);
}

void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize)
{
    /* If the buffers to be provided to the Idle task are declared inside this
    function then they must be declared static - otherwise they will be allocated on
    the stack and so not exists after this function exits. */
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[ configMINIMAL_STACK_SIZE ];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle task's
    state will be stored. */
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    /* Pass out the array that will be used as the Idle task's stack. */
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
    Note that, as the array is necessarily of type StackType_t,
    configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}

/* configSUPPORT_STATIC_ALLOCATION and configUSE_TIMERS are both set to 1, so the
application must provide an implementation of vApplicationGetTimerTaskMemory()
to provide the memory that is used by the Timer service task. */
void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer, StackType_t **ppxTimerTaskStackBuffer, uint32_t *pulTimerTaskStackSize)
{
    /* If the buffers to be provided to the Timer task are declared inside this
    function then they must be declared static - otherwise they will be allocated on
    the stack and so not exists after this function exits. */
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[ configTIMER_TASK_STACK_DEPTH ];

